transonic-bump/setups.orig/SpalartAllmarasIDDES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    start -3.2;
    inner1 -1.2;
    inner2 2.4;
    end  4.4;
    rA     1; // radius of inlet patch
    rAA    0.375;
    rB       4; // outer radius
    lengthCells1 40;
    lengthCells2 600;
    lengthCells3 40;
    rAcells 80;
    rBcells 10;
}

scale   0.2032;

vertices
(
    ($:backgroundMesh.start   $:backgroundMesh.rAA -1)  // 0
    ($:backgroundMesh.inner1  $:backgroundMesh.rAA -1)  // 1
    ($:backgroundMesh.inner2  $:backgroundMesh.rAA -1)  // 2
    ($:backgroundMesh.end     $:backgroundMesh.rAA -1)  // 3
    ($:backgroundMesh.start   $:backgroundMesh.rA -1)   // 4
    ($:backgroundMesh.inner1  $:backgroundMesh.rA -1)   // 5
    ($:backgroundMesh.inner2  $:backgroundMesh.rA -1)   // 6
    ($:backgroundMesh.end     $:backgroundMesh.rA -1)   // 7
    ($:backgroundMesh.start   $:backgroundMesh.rB -1)   // 8
    ($:backgroundMesh.inner1  $:backgroundMesh.rB -1)   // 9
    ($:backgroundMesh.inner2  $:backgroundMesh.rB -1)   // 10
    ($:backgroundMesh.end     $:backgroundMesh.rB -1)   // 11
 
    ($:backgroundMesh.start   $:backgroundMesh.rAA  0) // 12
    ($:backgroundMesh.inner1  $:backgroundMesh.rAA  0) // 13
    ($:backgroundMesh.inner2  $:backgroundMesh.rAA  0) // 14
    ($:backgroundMesh.end     $:backgroundMesh.rAA  0) // 15
    ($:backgroundMesh.start   $:backgroundMesh.rA  0)  // 16
    ($:backgroundMesh.inner1  $:backgroundMesh.rA  0)  // 17
    ($:backgroundMesh.inner2  $:backgroundMesh.rA  0)  // 18
    ($:backgroundMesh.end     $:backgroundMesh.rA  0)  // 19
    ($:backgroundMesh.start   $:backgroundMesh.rB  0)  // 20
    ($:backgroundMesh.inner1  $:backgroundMesh.rB  0)  // 21
    ($:backgroundMesh.inner2  $:backgroundMesh.rB  0)  // 22
    ($:backgroundMesh.end     $:backgroundMesh.rB  0)  // 23
);

blocks
(
    hex (0 1 5 4 12 13 17 16)
    ($:backgroundMesh.lengthCells1 $:backgroundMesh.rAcells 1)
    simpleGrading (0.1 50000 1)

    hex (1 2 6 5 13 14 18 17)
    ($:backgroundMesh.lengthCells2 $:backgroundMesh.rAcells 1)
    simpleGrading (((0.5 0.5 0.5)(0.5 0.5 2)) 50000 1)

    hex (2 3 7 6 14 15 19 18)
    ($:backgroundMesh.lengthCells3 $:backgroundMesh.rAcells 1)
    simpleGrading (10 50000 1)

    hex (4 5 9 8 16 17 21 20)
    ($:backgroundMesh.lengthCells1 $:backgroundMesh.rBcells 1)
    simpleGrading (0.1 5 1)


    hex (5 6 10 9 17 18 22 21)
    ($:backgroundMesh.lengthCells2 $:backgroundMesh.rBcells 1)
    simpleGrading (((0.5 0.5 0.5)(0.5 0.5 2)) 5 1)

    hex (6 7 11 10 18 19 23 22)
    ($:backgroundMesh.lengthCells3 $:backgroundMesh.rBcells 1)
    simpleGrading (10 5 1)
);

edges
(
        polyLine 1 2
        (
( -1.135274053E+00 3.750000000E-01 -1)
( -1.037906051E+00 3.750000000E-01 -1)
( -9.455015063E-01 3.750000000E-01 -1)
( -8.578085899E-01 3.750000000E-01 -1)
( -7.745866776E-01 3.750000000E-01 -1)
( -6.956080198E-01 3.750000000E-01 -1)
( -6.206560135E-01 3.750000000E-01 -1)
( -5.495254993E-01 3.750000000E-01 -1)
( -4.820216894E-01 3.750000000E-01 -1)
( -4.179595113E-01 3.750000000E-01 -1)
( -3.571636081E-01 3.750000000E-01 -1)
( -2.994674146E-01 3.750000000E-01 -1)
( -2.447129041E-01 3.750000000E-01 -1)
( -1.927500963E-01 3.750000000E-01 -1)
( -1.434367001E-01 3.750070035E-01 -1)
( -9.663748741E-02 3.764061928E-01 -1)
( -5.222439021E-02 3.799898922E-01 -1)
( -1.007572003E-02 3.854466975E-01 -1)
( 2.992396988E-02 3.925108016E-01  -1)
( 6.788425893E-02 4.009535909E-01  -1)
( 1.039090976E-01 4.105775952E-01  -1)
( 1.380971968E-01 4.204668999E-01  -1)
( 1.705421954E-01 4.288595021E-01  -1)
( 2.013330013E-01 4.360538125E-01  -1)
( 2.305538952E-01 4.421983957E-01  -1)
( 2.582848966E-01 4.474233091E-01  -1)
( 2.846021056E-01 4.518417120E-01  -1)
( 3.095774949E-01 4.555532932E-01  -1)
( 3.332794905E-01 4.586454034E-01  -1)
( 3.557730019E-01 4.611949921E-01  -1)
( 3.771196902E-01 4.632700086E-01  -1)
( 3.973779976E-01 4.649302959E-01  -1)
( 4.166033864E-01 4.662286043E-01  -1)
( 4.348486066E-01 4.672116935E-01  -1)
( 4.521636069E-01 4.679208994E-01  -1)
( 4.685957134E-01 4.683927000E-01  -1)
( 4.841899872E-01 4.686594903E-01  -1)
( 4.989893138E-01 4.687496126E-01  -1)
( 5.130339861E-01 4.686884880E-01  -1)
( 5.263625979E-01 4.684982896E-01  -1)
( 5.390117168E-01 4.681986868E-01  -1)
( 5.510157943E-01 4.678069949E-01  -1)
( 5.624079704E-01 4.673385918E-01  -1)
( 5.732191801E-01 4.668068886E-01  -1)
( 5.834792852E-01 4.662235975E-01  -1)
( 5.932161808E-01 4.655990899E-01  -1)
( 6.024566889E-01 4.649426043E-01  -1)
( 6.112260818E-01 4.642618001E-01  -1)
( 6.195483208E-01 4.635637999E-01  -1)
( 6.274461746E-01 4.628542960E-01  -1)
( 6.349415183E-01 4.621388018E-01  -1)
( 6.420546174E-01 4.614214897E-01  -1)
( 6.488050222E-01 4.607064128E-01  -1)
( 6.552113295E-01 4.599966109E-01  -1)
( 6.612908840E-01 4.592950940E-01  -1)
( 6.670606136E-01 4.586040080E-01  -1)
( 6.725360751E-01 4.579252899E-01  -1)
( 6.777324080E-01 4.572606981E-01  -1)
( 6.826637983E-01 4.566113949E-01  -1)
( 6.873437762E-01 4.559785128E-01  -1)
( 6.917850971E-01 4.553627968E-01  -1)
( 6.959999800E-01 4.547649026E-01  -1)
( 6.999999881E-01 4.541850984E-01  -1)
( 7.039999962E-01 4.535934031E-01  -1)
( 7.080000043E-01 4.529897869E-01  -1)
( 7.121384144E-01 4.523526132E-01  -1)
( 7.164198756E-01 4.516797960E-01  -1)
( 7.208495736E-01 4.509693086E-01  -1)
( 7.254325151E-01 4.502185881E-01  -1)
( 7.301740050E-01 4.494253099E-01  -1)
( 7.350795269E-01 4.485867023E-01  -1)
( 7.401546836E-01 4.476997852E-01  -1)
( 7.454054952E-01 4.467616975E-01  -1)
( 7.508379817E-01 4.457691908E-01  -1)
( 7.564584017E-01 4.447185993E-01  -1)
( 7.622731924E-01 4.436061978E-01  -1)
( 7.682892084E-01 4.424282014E-01  -1)
( 7.745134234E-01 4.411801100E-01  -1)
( 7.809528112E-01 4.398575127E-01  -1)
( 7.876151204E-01 4.384554923E-01  -1)
( 7.945078015E-01 4.369687140E-01  -1)
( 8.016390204E-01 4.353916943E-01  -1)
( 8.090168834E-01 4.337184131E-01  -1)
( 8.166499734E-01 4.319424033E-01  -1)
( 8.245471716E-01 4.300568104E-01  -1)
( 8.327175975E-01 4.280540943E-01  -1)
( 8.411707282E-01 4.259265065E-01  -1)
( 8.499162793E-01 4.236654043E-01  -1)
( 8.589643240E-01 4.212616980E-01  -1)
( 8.683254123E-01 4.187054038E-01  -1)
( 8.780103922E-01 4.159860909E-01  -1)
( 8.880304098E-01 4.130922854E-01  -1)
( 8.983970881E-01 4.100117981E-01  -1)
( 9.091224074E-01 4.067313075E-01  -1)
( 9.202188253E-01 4.032365978E-01  -1)
( 9.316989779E-01 3.995124996E-01  -1)
( 9.435763955E-01 3.955422044E-01  -1)
( 9.558647871E-01 3.913078904E-01  -1)
( 9.685782194E-01 3.867900968E-01  -1)
( 9.817314744E-01 3.821974099E-01  -1)
( 9.953398108E-01 3.785755932E-01  -1)
( 1.009418964E+00 3.761748075E-01  -1)
( 1.023985028E+00 3.750655055E-01  -1)
( 1.039054990E+00 3.750000000E-01  -1)
( 1.054646969E+00 3.750000000E-01  -1)
( 1.070778012E+00 3.750000000E-01  -1)
( 1.087466955E+00 3.750000000E-01  -1)
( 1.104732990E+00 3.750000000E-01  -1)
( 1.122596979E+00 3.750000000E-01  -1)
( 1.141077995E+00 3.750000000E-01  -1)
( 1.160199046E+00 3.750000000E-01  -1)
( 1.179981947E+00 3.750000000E-01  -1)
( 1.200448990E+00 3.750000000E-01  -1)
( 1.221624017E+00 3.750000000E-01  -1)
( 1.243530989E+00 3.750000000E-01  -1)
( 1.266196966E+00 3.750000000E-01  -1)
( 1.289646029E+00 3.750000000E-01  -1)
( 1.313907027E+00 3.750000000E-01  -1)
( 1.339007974E+00 3.750000000E-01  -1)
( 1.364976048E+00 3.750000000E-01  -1)
( 1.391842961E+00 3.750000000E-01  -1)
( 1.419638991E+00 3.750000000E-01  -1)
( 1.448397994E+00 3.750000000E-01  -1)
( 1.478150964E+00 3.750000000E-01  -1)
( 1.508932948E+00 3.750000000E-01  -1)
( 1.540779948E+00 3.750000000E-01  -1)
( 1.573729038E+00 3.750000000E-01  -1)
( 1.607818007E+00 3.750000000E-01  -1)
( 1.643085957E+00 3.750000000E-01  -1)
( 1.679574966E+00 3.750000000E-01  -1)
( 1.717324972E+00 3.750000000E-01  -1)
( 1.756381989E+00 3.750000000E-01  -1)
( 1.796790004E+00 3.750000000E-01  -1)
( 1.838595986E+00 3.750000000E-01  -1)
( 1.881847978E+00 3.750000000E-01  -1)
( 1.926596999E+00 3.750000000E-01  -1)
( 1.972893000E+00 3.750000000E-01  -1)
( 2.020792007E+00 3.750000000E-01  -1)
( 2.070347071E+00 3.750000000E-01  -1)
( 2.121617079E+00 3.750000000E-01  -1)
( 2.174659967E+00 3.750000000E-01  -1)
( 2.229538918E+00 3.750000000E-01  -1)
( 2.286315918E+00 3.750000000E-01  -1)
( 2.345057964E+00 3.750000000E-01  -1)
        )

        polyLine 13 14
        (
( -1.135274053E+00 3.750000000E-01 0)
( -1.037906051E+00 3.750000000E-01 0)
( -9.455015063E-01 3.750000000E-01 0)
( -8.578085899E-01 3.750000000E-01 0)
( -7.745866776E-01 3.750000000E-01 0)
( -6.956080198E-01 3.750000000E-01 0)
( -6.206560135E-01 3.750000000E-01 0)
( -5.495254993E-01 3.750000000E-01 0)
( -4.820216894E-01 3.750000000E-01 0)
( -4.179595113E-01 3.750000000E-01 0)
( -3.571636081E-01 3.750000000E-01 0)
( -2.994674146E-01 3.750000000E-01 0)
( -2.447129041E-01 3.750000000E-01 0)
( -1.927500963E-01 3.750000000E-01 0)
( -1.434367001E-01 3.750070035E-01 0)
( -9.663748741E-02 3.764061928E-01 0)
( -5.222439021E-02 3.799898922E-01 0)
( -1.007572003E-02 3.854466975E-01 0)
( 2.992396988E-02 3.925108016E-01  0)
( 6.788425893E-02 4.009535909E-01  0)
( 1.039090976E-01 4.105775952E-01  0)
( 1.380971968E-01 4.204668999E-01  0)
( 1.705421954E-01 4.288595021E-01  0)
( 2.013330013E-01 4.360538125E-01  0)
( 2.305538952E-01 4.421983957E-01  0)
( 2.582848966E-01 4.474233091E-01  0)
( 2.846021056E-01 4.518417120E-01  0)
( 3.095774949E-01 4.555532932E-01  0)
( 3.332794905E-01 4.586454034E-01  0)
( 3.557730019E-01 4.611949921E-01  0)
( 3.771196902E-01 4.632700086E-01  0)
( 3.973779976E-01 4.649302959E-01  0)
( 4.166033864E-01 4.662286043E-01  0)
( 4.348486066E-01 4.672116935E-01  0)
( 4.521636069E-01 4.679208994E-01  0)
( 4.685957134E-01 4.683927000E-01  0)
( 4.841899872E-01 4.686594903E-01  0)
( 4.989893138E-01 4.687496126E-01  0)
( 5.130339861E-01 4.686884880E-01  0)
( 5.263625979E-01 4.684982896E-01  0)
( 5.390117168E-01 4.681986868E-01  0)
( 5.510157943E-01 4.678069949E-01  0)
( 5.624079704E-01 4.673385918E-01  0)
( 5.732191801E-01 4.668068886E-01  0)
( 5.834792852E-01 4.662235975E-01  0)
( 5.932161808E-01 4.655990899E-01  0)
( 6.024566889E-01 4.649426043E-01  0)
( 6.112260818E-01 4.642618001E-01  0)
( 6.195483208E-01 4.635637999E-01  0)
( 6.274461746E-01 4.628542960E-01  0)
( 6.349415183E-01 4.621388018E-01  0)
( 6.420546174E-01 4.614214897E-01  0)
( 6.488050222E-01 4.607064128E-01  0)
( 6.552113295E-01 4.599966109E-01  0)
( 6.612908840E-01 4.592950940E-01  0)
( 6.670606136E-01 4.586040080E-01  0)
( 6.725360751E-01 4.579252899E-01  0)
( 6.777324080E-01 4.572606981E-01  0)
( 6.826637983E-01 4.566113949E-01  0)
( 6.873437762E-01 4.559785128E-01  0)
( 6.917850971E-01 4.553627968E-01  0)
( 6.959999800E-01 4.547649026E-01  0)
( 6.999999881E-01 4.541850984E-01  0)
( 7.039999962E-01 4.535934031E-01  0)
( 7.080000043E-01 4.529897869E-01  0)
( 7.121384144E-01 4.523526132E-01  0)
( 7.164198756E-01 4.516797960E-01  0)
( 7.208495736E-01 4.509693086E-01  0)
( 7.254325151E-01 4.502185881E-01  0)
( 7.301740050E-01 4.494253099E-01  0)
( 7.350795269E-01 4.485867023E-01  0)
( 7.401546836E-01 4.476997852E-01  0)
( 7.454054952E-01 4.467616975E-01  0)
( 7.508379817E-01 4.457691908E-01  0)
( 7.564584017E-01 4.447185993E-01  0)
( 7.622731924E-01 4.436061978E-01  0)
( 7.682892084E-01 4.424282014E-01  0)
( 7.745134234E-01 4.411801100E-01  0)
( 7.809528112E-01 4.398575127E-01  0)
( 7.876151204E-01 4.384554923E-01  0)
( 7.945078015E-01 4.369687140E-01  0)
( 8.016390204E-01 4.353916943E-01  0)
( 8.090168834E-01 4.337184131E-01  0)
( 8.166499734E-01 4.319424033E-01  0)
( 8.245471716E-01 4.300568104E-01  0)
( 8.327175975E-01 4.280540943E-01  0)
( 8.411707282E-01 4.259265065E-01  0)
( 8.499162793E-01 4.236654043E-01  0)
( 8.589643240E-01 4.212616980E-01  0)
( 8.683254123E-01 4.187054038E-01  0)
( 8.780103922E-01 4.159860909E-01  0)
( 8.880304098E-01 4.130922854E-01  0)
( 8.983970881E-01 4.100117981E-01  0)
( 9.091224074E-01 4.067313075E-01  0)
( 9.202188253E-01 4.032365978E-01  0)
( 9.316989779E-01 3.995124996E-01  0)
( 9.435763955E-01 3.955422044E-01  0)
( 9.558647871E-01 3.913078904E-01  0)
( 9.685782194E-01 3.867900968E-01  0)
( 9.817314744E-01 3.821974099E-01  0)
( 9.953398108E-01 3.785755932E-01  0)
( 1.009418964E+00 3.761748075E-01  0)
( 1.023985028E+00 3.750655055E-01  0)
( 1.039054990E+00 3.750000000E-01  0)
( 1.054646969E+00 3.750000000E-01  0)
( 1.070778012E+00 3.750000000E-01  0)
( 1.087466955E+00 3.750000000E-01  0)
( 1.104732990E+00 3.750000000E-01  0)
( 1.122596979E+00 3.750000000E-01  0)
( 1.141077995E+00 3.750000000E-01  0)
( 1.160199046E+00 3.750000000E-01  0)
( 1.179981947E+00 3.750000000E-01  0)
( 1.200448990E+00 3.750000000E-01  0)
( 1.221624017E+00 3.750000000E-01  0)
( 1.243530989E+00 3.750000000E-01  0)
( 1.266196966E+00 3.750000000E-01  0)
( 1.289646029E+00 3.750000000E-01  0)
( 1.313907027E+00 3.750000000E-01  0)
( 1.339007974E+00 3.750000000E-01  0)
( 1.364976048E+00 3.750000000E-01  0)
( 1.391842961E+00 3.750000000E-01  0)
( 1.419638991E+00 3.750000000E-01  0)
( 1.448397994E+00 3.750000000E-01  0)
( 1.478150964E+00 3.750000000E-01  0)
( 1.508932948E+00 3.750000000E-01  0)
( 1.540779948E+00 3.750000000E-01  0)
( 1.573729038E+00 3.750000000E-01  0)
( 1.607818007E+00 3.750000000E-01  0)
( 1.643085957E+00 3.750000000E-01  0)
( 1.679574966E+00 3.750000000E-01  0)
( 1.717324972E+00 3.750000000E-01  0)
( 1.756381989E+00 3.750000000E-01  0)
( 1.796790004E+00 3.750000000E-01  0)
( 1.838595986E+00 3.750000000E-01  0)
( 1.881847978E+00 3.750000000E-01  0)
( 1.926596999E+00 3.750000000E-01  0)
( 1.972893000E+00 3.750000000E-01  0)
( 2.020792007E+00 3.750000000E-01  0)
( 2.070347071E+00 3.750000000E-01  0)
( 2.121617079E+00 3.750000000E-01  0)
( 2.174659967E+00 3.750000000E-01  0)
( 2.229538918E+00 3.750000000E-01  0)
( 2.286315918E+00 3.750000000E-01  0)
( 2.345057964E+00 3.750000000E-01  0)
        )

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 12 16 4)
	    (4 16 20 8)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 15 19 7)
            (7 19 23 11)
        );
    }


    front
    {
        type symmetry;
        faces
        (
            (12 13 17 16)
            (13 14 18 17)
            (14 15 19 18)
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
        );
    }

    back
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
        );
    }
   
    obstacle
    {
	type wall;
        faces
        (
	    (1 2 14 13)
        );

    }

    upwall
    {
        type symmetry;
        faces
        (
           (0 1 13 12)
        );
    }

    downwall
    {
        type symmetry;
        faces
        (
           (2 3 15 14)
        );
    }

    top
    {
        type symmetry;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
            (10 11 23 22)
        );
    }



);

mergePatchPairs
(
);

// ************************************************************************* //
