transonic-bump/setups.orig/SpalartAllmarasIDDES/0.orig/h
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      h;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value $internalField;
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type symmetry;
    }
    obstacle
    {
        type            fixedValue;
        value           uniform  0.11;
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }



    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
