transonic-bump/setups.orig/SpalartAllmarasIDDES/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.08e-3;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;

//        type turbulentIntensityKineticEnergyInlet;
//        U    U;
//        phi  phi;
//        intensity 0.05;
//        value uniform $kInlet;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

//	type  zeroGradient;
    }

    top
    {
        type symmetry;
    }
    obstacle
    {
        type            kqRWallFunction;
        value           $internalField;

        //type zeroGradient;
//        type      kqRWallFunction;
//       value     uniform 121;
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }



    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
